[
  {
    "image": "https://i.ibb.co.com/BHBCJtNd/tiktok.png",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 1,
    "description": "TikTok, launched by ByteDance in 2016, is a dynamic platform for short-form mobile videos, transforming how we create and consume content. With over 1.5 billion downloads, its algorithm powers a personalized For You feed, serving 15-second to 10-minute clips of viral dances, comedy skits, life hacks, and educational bites tailored to your tastes. Anyone can become a creator using TikTok’s intuitive tools: record with your phone, then enhance with filters, AR effects, stickers, and a vast music library featuring artists from Billie Eilish to indie gems. Editing features like duets, stitches, and green screen effects make polished videos effortless.TikTok fosters community through likes, comments, shares, and live streaming, where creators engage fans with Q&As or virtual gifts. Hashtags like #FYP boost discoverability, while TikTok Shop integrates seamless shopping. Available on iOS (12.0+) and Android (5.0+), the app includes privacy options like family pairing for parental oversight, though users should be aware of data collection for personalization. From sparking global trends in music and fashion to fueling memes, TikTok is a cultural juggernaut. Whether you're scrolling or creating, it’s an addictive, creative hub that redefines entertainment for millions worldwide.",
    "size": 300,
    "reviews": 1.5,
    "ratingAvg": 4.5,
    "downloads": 8.26,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 9200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Zzkg44F3/Instagram.jpg",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "Instagram, launched in 2010 by Meta, is a leading social media platform for sharing photos, videos, and stories, with over 2 billion monthly active users. Available on iOS (14.0+) and Android (9.0+), it offers a vibrant space to connect, create, and explore. Users can post images and videos to their feed, enhanced by filters, stickers, and editing tools, or share ephemeral Stories that vanish after 24 hours. Reels, Instagram’s answer to short-form video, lets users craft 15- to 90-second clips with music, effects, and AR overlays, rivaling TikTok’s creative appeal. The app’s algorithm curates a personalized Explore page, spotlighting trending content from fashion to fitness. Instagram fosters engagement through likes, comments, follows, and direct messaging. Live streaming enables real-time interaction, while IGTV supports longer videos. Instagram Shop integrates e-commerce, letting users browse and buy products directly. Creators and businesses leverage tools like Insights for analytics and paid promotions for reach. Privacy features include private accounts and parental controls via Family Center. While data collection fuels tailored ads, robust privacy settings empower user control. From influencers to everyday users, Instagram shapes trends, builds communities, and celebrates visual storytelling, making it a cultural cornerstone for self-expression and connection.",
    "size": 190,
    "reviews": 2.11,
    "ratingAvg": 4.6,
    "downloads": 8.17,
    "ratings": [
      { "name": "1 star", "count": 700000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 13000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/KpfV7sn1/fb.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Facebook, launched in 2004 by Mark Zuckerberg and his Harvard roommates, is a global social media platform that connects billions of users. It allows people to create profiles, share posts, photos, and videos, and engage with friends, family, and communities through likes, comments, and messages. The platform supports diverse content, from personal updates to news and entertainment, fostering interaction across its vast network.Beyond social networking, Facebook offers features like Marketplace for buying and selling, Groups for shared interests, and Events for organizing gatherings. It also owns Instagram, WhatsApp, and Oculus, expanding its digital ecosystem. Businesses leverage Facebook for advertising, utilizing its targeted ad system to reach specific audiences. The platform’s algorithm prioritizes content based on user engagement, shaping what appears in the News Feed.Despite its popularity, Facebook has faced criticism over privacy concerns, data security, and misinformation. It remains a dominant force in social media, with a mission to bring people closer together. Available on web and mobile apps, it continues to evolve with features like Stories and Reels, adapting to trends while maintaining its core focus on connection and communication.",
    "size": 80,
    "reviews": 1.25,
    "ratingAvg": 4.0,
    "downloads": 5.97,
    "ratings": [
      { "name": "1 star", "count": 10000000 },
      { "name": "2 star", "count": 12000000 },
      { "name": "3 star", "count": 25000000 },
      { "name": "4 star", "count": 38000000 },
      { "name": "5 star", "count": 40000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/7tTVSXMG/Whats-App-Messenger.png",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 4,
    "description": "Free, end-to-end encrypted messaging, voice, and video calls for global communication.",
    "size": 120,
    "reviews": 7.72,
    "ratingAvg": 4.5,
    "downloads": 5.64,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 4200000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 44000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HDD6WXP7/Temu.png",
    "title": "Temu",
    "companyName": "Pinduoduo",
    "id": 5,
    "description": "Temu, launched in September 2022, is a fast-growing online marketplace operated by PDD Holdings, a Cayman Islands-registered company owned by Chinese entrepreneur Colin Huang. Originally founded in Boston, Massachusetts, it connects consumers directly with manufacturers and sellers, primarily in China, offering heavily discounted products shipped straight to buyers. By April 2025, Temu had expanded to over 90 markets worldwide, including the U.S., Europe, Latin America, Australia, New Zealand, and South Africa. It quickly became a sensation, topping U.S. app download charts in late 2022 and ranking as the world's second-most-visited online shopping site by September 2024, according to Similarweb.The platform's slogan, Shop Like a Billionaire, reflects its model of ultra-low prices on a vast array of items—from fashion, beauty, and jewelry to home decor, electronics, tools, and handmade crafts. Available via web and mobile apps on iOS and Android, Temu features daily deals, free shipping on qualifying orders, 90-day returns, and gamified elements like referral bonuses and flash sales. Users praise its affordability and selection, with reviews highlighting pennies on the dollar for quality tools and addictive bargain-hunting, though some note sizing inconsistencies and smaller-than-expected items.Temu's direct-from-factory approach bypasses traditional retail markups and, until recent U.S. tariff changes, exploited the de minimis shipping loophole for duty-free imports under $800. In 2025, it adapted by stocking U.S. warehouses to avoid surprise fees, delighting shoppers who feared hikes. However, its rapid rise has sparked controversies. Concerns include data privacy risks from extensive user tracking, potential forced labor in supply chains (lacking compliance with the Uyghur Forced Labor Prevention Act), intellectual property theft, and low product quality. In October 2025, Germany's Federal Cartel Office launched an investigation into Temu for suspected price-fixing and unfair supplier treatment, amid its 19.3 million active German users. Legal battles with rival Shein over competition tactics continue, underscoring Temu's disruptive yet scrutinized presence in global e-commerce.",
    "size": 180,
    "reviews": 8.5,
    "ratingAvg": 4.4,
    "downloads": 5.16,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 2300000 },
      { "name": "5 star", "count": 4000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/7dYh003w/Telegrams.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 6,
    "description": "Telegram, founded in 2013 by Russian brothers Pavel and Nikolai Durov, is a cloud-based instant messaging app emphasizing speed, privacy, and free expression. Born from the Durovs' fallout with Russian authorities over their social network VKontakte, Telegram was designed as a secure alternative to apps like WhatsApp, prioritizing user data protection against surveillance. Headquartered in Dubai with legal ties to the British Virgin Islands, it remains ad-free and funded largely by Pavel Durov's personal investments, though it introduced premium subscriptions in 2022 for enhanced features like faster downloads and exclusive stickers.As of March 2025, Telegram boasts over 1 billion monthly active users, with India leading in adoption. Available on iOS, Android, desktop, and web, it supports text, voice/video calls, file sharing up to 2GB, and multimedia editing. Standout features include massive groups (up to 200,000 members), broadcast channels for unlimited subscribers, bots for automation, and Stories for ephemeral sharing. Secret Chats offer end-to-end encryption with self-destructing messages, while standard chats use server-client encryption for seamless multi-device syncing. In April 2025, Telegram rolled out end-to-end encrypted group calls for up to 200 participants, including screen sharing, powered by blockchain-inspired tech. Its crypto wallet, TON, expanded in March 2025 with multi-asset trading and yields. A landmark partnership with xAI in 2025 integrated Grok AI for $300 million, enabling full chatbot functions within the app.Despite its appeal, Telegram faces intense scrutiny. Its lax moderation has made it a haven for extremists—from ISIS propaganda in 2015 to QAnon, Hamas, and UK riot coordination—drawing bans in countries like Vietnam (May 2025), Nepal (July 2025), and Kenya (June 2025) over fraud, terrorism, and misinformation. Founder Pavel Durov's 2024 arrest in France highlighted concerns about child exploitation and non-cooperation with law enforcement. Critics decry its custom MTProto encryption as unproven, metadata collection, and tolerance of deepfakes, malware, and phishing kits. Yet, Telegram's staunch free-speech stance—processing only public content requests—fuels its growth among dissidents and journalists worldwide.",
    "size": 95,
    "reviews": 5.5,
    "ratingAvg": 4.3,
    "downloads": 4.47,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 2300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Y7zqnpwk/CapCut.png",
    "title": "CapCut",
    "companyName": "ByteDance Pte. Ltd.",
    "id": 7,
    "description": "CapCut, originally launched as JianYing in China in 2019 by ByteDance—the parent company of TikTok—is a versatile AI-powered video editing app rebranded internationally as ViaMaker before settling on its current name. Designed for creators of all levels, it enables quick edits on mobile, desktop, web, and even HarmonyOS devices, with a focus on social media-ready content like TikTok videos. By early 2025, CapCut had amassed hundreds of millions of users globally, praised for its intuitive drag-and-drop interface and free core features, though Pro subscriptions unlock premium assets like advanced effects and 4K exports.Key features include AI tools for auto-captions, background removal, voice changers, text-to-speech, motion tracking, and long-video-to-shorts conversion, alongside traditional options like keyframe animation, chroma key, slow-motion stabilization, and a vast library of music, stickers, and transitions. The desktop version, released in 2021 for Windows and Mac, supports complex projects with cloud storage for seamless multi-device syncing. In May 2025, updates added enhanced AI color grading, face tracking, and pro effects, making it ideal for marketing and educational content like historical recreations.However, CapCut's ByteDance ties sparked controversies over data privacy and national security, leading to bans in India since 2020 and a U.S. enforcement under the 2024 Protecting Americans from Foreign Adversary Controlled Applications Act. The app was temporarily removed from U.S. stores on January 19, 2025, alongside TikTok, but returned after a 75-day extension for divestiture talks, though it vanished again by March, prompting users to migrate to alternatives like Adobe Premiere Rush or InShot. Critics also lament limited customer support and occasional aggressive upselling in the free tier. Despite hurdles, CapCut's blend of accessibility and innovation cements its role in democratizing video creation worldwide.",
    "size": 250,
    "reviews": 4.0,
    "ratingAvg": 4.6,
    "downloads": 4.1,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 2300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/6RgJ0gDH/Google-Play-Store.jpg",
    "title": "Google Play Store",
    "companyName": "Google LLC",
    "id": 8,
    "description": "The Google Play Store, launched in 2008 as the Android Market, is Google’s official digital marketplace for Android devices, offering millions of apps, games, movies, TV shows, books, and music. As of October 2025, it remains the largest app store globally, serving over 2.5 billion active Android devices. Available on smartphones, tablets, wearables, TVs, cars, and web browsers, it provides a seamless platform for downloading and updating content, with a user-friendly interface and personalized recommendations driven by machine learning.Key features include robust app discovery through curated collections, editor’s picks, and search filters, alongside in-app purchases, subscriptions, and family-sharing options. Developers benefit from tools like Play Console for app management and monetization, with Google taking a 30% commission (15% for smaller developers). Security features like Play Protect scan apps for malware, ensuring user safety. Recent updates emphasize privacy dashboards, data deletion options, and enhanced parental controls.Despite its dominance, the Play Store faces scrutiny over monopolistic practices, with lawsuits challenging its commission structure and app restrictions. Competition from alternative stores like Samsung Galaxy Store persists, yet Google’s ecosystem integration keeps it central to Android’s success.",
    "size": 50,
    "reviews": 4.0,
    "ratingAvg": 4.1,
    "downloads": 1.0,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 12000000 },
      { "name": "5 star", "count": 13000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/fGFHsVpz/Threads.png",
    "title": "Threads",
    "companyName": "Meta Platforms, Inc.",
    "id": 9,
    "description": "Threads, launched by Meta on July 5, 2023, is a text-based social media app designed as a direct rival to X (formerly Twitter), integrating seamlessly with Instagram. Users sign up via their Instagram accounts, retaining followers and handles, to post up to 500-character updates, photos, videos (up to 5 minutes), links, and polls in a feed blending followed accounts and algorithmically recommended content. Available on iOS, Android, and web (via threads.com since April 2025), it emphasizes real-time conversations, with features like Topic Tags (evolved from hashtags), replies, reposts, and AI-generated post summaries for quick overviews. As of October 2025, Threads has surged to over 400 million monthly active users (MAUs) and 100 million daily active users (DAUs), doubling from 200 million MAUs in under a year, driven by dissatisfaction with X's changes under Elon Musk, such as paid verification and rate limits. The U.S. leads with 33.9 million MAUs, followed by India and Brazil.Recent 2025 updates include ads in the For You feed (rolled out early), expanded media posts (up to 20 photos/videos), drafts, light/dark mode toggles, cross-posting to Facebook (iOS-only, non-EU), and end-to-end encrypted DMs. In October, Meta introduced Communities over 100 topic-based groups for deeper discussions on niches like K-pop, books, and NBA—adding profile tags for visibility. A Fediverse feed (summer 2025) enables interoperability with platforms like Mastodon via ActivityPub. Revenue hit $4.4 billion in 2024, projected at $8 billion for 2025, with forecasts of $11.3 billion by 2026 from targeted ads.Threads has outpaced X in global DAUs by September 2025, amid X's 66% UK ad revenue drop, but faces backlash over Meta's data privacy scandals, broad user tracking, and initial IP disputes with X (resolved). Critics highlight de-amplification of controversial content to curb misinformation, yet its Instagram ties raise monopoly concerns in the EU.",
    "size": 100,
    "reviews": 2.5,
    "ratingAvg": 4.0,
    "downloads": 3.26,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/PZCDv3DC/Whats-App-Business.jpg",
    "title": "WhatsApp Business",
    "companyName": "Meta Platforms, Inc.",
    "id": 10,
    "description": "WhatsApp Business, launched in 2018 by Meta Platforms (formerly Facebook), is a free messaging app tailored for small and medium-sized enterprises (SMEs) to communicate with customers. It builds on the core WhatsApp platform—boasting over 2.95 billion monthly active users globally in 2025—by adding business-specific tools like a verified profile with address, hours, and website; quick replies for FAQs; automated away messages; and product catalogs for showcasing items directly in chats. Available on Android, iOS, and desktop, it supports end-to-end encryption for secure interactions, including voice/video calls, file sharing, and labels for organizing conversations.The paid WhatsApp Business API, integrated with platforms like chatbots and CRM systems, enables scalable features such as bulk messaging, analytics, and multi-agent support for larger operations. In 2025, it has over 764 million monthly active users, with 200 million using catalogs monthly; downloads hit 106.66 million year-to-date, led by India (highest adoption) and Indonesia. Businesses report 98% open rates and 45-60% reply rates, far surpassing email, while chatbots are projected to save 2.6 billion hours annually. Recent updates include AI-powered personalization, payment integrations in markets like India and Brazil, and Channels for broadcasts reaching 150 countries.Despite its dominance—generating $1.7 billion in 2024 revenue, projected at $3.6 billion for 2025—WhatsApp Business faces backlash over privacy policies tied to Meta's data-sharing practices, which sparked user exodus in 2021 and ongoing EU scrutiny under GDPR. Bans in countries like China and Iran limit reach, yet 80% of large enterprises plan API adoption by year-end, underscoring its role in customer engagement and e-commerce.",
    "size": 130,
    "reviews": 1.51,
    "ratingAvg": 4.4,
    "downloads": 2.94,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 4200000 },
      { "name": "5 star", "count": 8000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TDTgGcxb/Messenger.png",
    "title": "Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 11,
    "description": "Messenger, developed by Meta, is a free instant messaging app launched in 2011 as a standalone extension of Facebook’s chat feature. Available on iOS, Android, web, and desktop, it enables text, voice, and video communication for over 1.2 billion monthly active users as of 2025, integrating seamlessly with Facebook and Instagram accounts. Key features include end-to-end encrypted chats, group chats (up to 250 members), video calls (up to 50 participants), and fun additions like stickers, GIFs, emojis, and AR effects. Users can send payments, share locations, and use bots for tasks like shopping or customer service. Recent 2025 updates introduced AI-powered reply suggestions, customizable chat themes, and enhanced file-sharing up to 100MB.Messenger’s cross-platform syncing ensures seamless conversations, while its Rooms feature supports large-scale video conferencing. Businesses leverage it for customer engagement via automated replies and ads. Despite its popularity, Messenger faces criticism over Meta’s data collection practices, raising privacy concerns under GDPR scrutiny in the EU. Competition from apps like WhatsApp and Telegram persists, yet its deep integration with Meta’s ecosystem and frequent updates—such as improved encryption and cross-app calling with WhatsApp—keep it a dominant player in global messaging.",
    "size": 90,
    "reviews": 1.12,
    "ratingAvg": 4.1,
    "downloads": 2.89,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 10000000 },
      { "name": "3 star", "count": 22000000 },
      { "name": "4 star", "count": 30000000 },
      { "name": "5 star", "count": 30000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Fb3y0R3G/ChatGPT.png",
    "title": "ChatGPT",
    "companyName": "OpenAI",
    "id": 12,
    "description": "Discover the power of conversational AI with ChatGPT, the advanced language model designed to assist, inform, and engage users worldwide. ChatGPT provides intelligent, context-aware responses for a wide range of tasks, including answering questions, generating creative content, drafting emails, coding assistance, language translation, and personalized learning. Whether you are a student seeking explanations, a professional looking for productivity tools, or a creative mind exploring ideas, ChatGPT offers seamless support across multiple domains. Enjoy an intuitive interface that makes interacting with AI simple and effective, with real-time responses and adaptable conversational flow. ChatGPT can help streamline daily tasks, provide educational guidance, and enhance decision-making with accurate and reliable information. With continuous updates and improvements, ChatGPT ensures users experience cutting-edge AI technology that evolves with their needs. Connect with this innovative platform to explore new ways of learning, problem-solving, and creativity, all through natural language conversation. ChatGPT empowers individuals, teams, and organizations to save time, boost productivity, and unlock potential by leveraging AI-driven assistance in a convenient and accessible way. Experience the future of communication and intelligent support with ChatGPT today.",
    "size": 50,
    "reviews": 2.56,
    "ratingAvg": 4.7,
    "downloads": 2.78,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 75000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 675000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/hFZ0JqBr/Spotify.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 13,
    "description": "Discover the ultimate music and podcast streaming experience with Spotify, the world’s leading audio platform. Explore millions of songs across all genres, including pop, rock, hip-hop, classical, jazz, and more, alongside an extensive library of podcasts covering news, entertainment, education, and storytelling. Create and share personalized playlists, follow your favorite artists, and enjoy curated recommendations tailored to your taste and listening habits. Spotify offers seamless streaming on smartphones, tablets, computers, smart speakers, and other devices, ensuring your favorite music and podcasts are always accessible. Discover new artists, exclusive releases, and seasonal hits while enjoying high-quality audio, offline playback, and ad-free premium options. Whether you are a casual listener seeking background music, a dedicated music lover exploring new tracks, or a podcast enthusiast craving insightful stories, Spotify provides a platform to connect, relax, and enjoy endless entertainment. Stay updated with weekly charts, trending playlists, and personalized mixes that make discovering music fun and effortless. Join millions of users worldwide who trust Spotify for an immersive, convenient, and personalized listening experience. Unlock the power of music and podcasts anytime, anywhere, and make every moment more enjoyable with Spotify.",
    "size": 150,
    "reviews": 2.0,
    "ratingAvg": 4.4,
    "downloads": 2.62,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 9000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/LdhCK0dx/YouTube.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 14,
    "description": "Discover the world of endless entertainment, learning, and creativity with YouTube, the world’s leading video-sharing platform. Explore millions of videos across categories including music, gaming, tutorials, vlogs, education, news, and lifestyle, all available on-demand. Connect with your favorite creators, subscribe to channels, and receive personalized recommendations tailored to your interests and viewing history. YouTube offers live streaming, community engagement through comments, likes, and shares, and the ability to create your own content to reach a global audience. Enjoy seamless streaming on smartphones, tablets, smart TVs, and computers, with high-quality video playback, captions, and multi-language support. Stay updated with trending videos, premieres, and exclusive content from creators worldwide. Whether you are seeking entertainment, inspiration, learning opportunities, or social interaction, YouTube provides a platform to explore, create, and share. With tools for content creation, monetization options, and a supportive community, YouTube empowers creators and viewers alike to express themselves, gain knowledge, and enjoy unlimited entertainment. Join millions of users worldwide and unlock a universe of videos, tutorials, music, and live streams that keep you informed, entertained, and inspired every day.",
    "size": 160,
    "reviews": 5.0,
    "ratingAvg": 4.3,
    "downloads": 50.0,
    "ratings": [
      { "name": "1 star", "count": 15000000 },
      { "name": "2 star", "count": 18000000 },
      { "name": "3 star", "count": 27000000 },
      { "name": "4 star", "count": 40000000 },
      { "name": "5 star", "count": 50000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zHHSTvtB/SHEIN.jpg",
    "title": "SHEIN",
    "companyName": "Roadget Business Pte. Ltd.",
    "id": 15,
    "description": "Discover the latest trends in fashion with SHEIN, the ultimate online shopping destination for women, men, and kids. SHEIN offers a vast collection of stylish clothing, shoes, accessories, and lifestyle products at affordable prices, making it easy to refresh your wardrobe anytime. Explore seasonal collections, trending outfits, and exclusive designs that cater to every style, from casual and streetwear to formal and party-ready looks. Enjoy seamless shopping with a user-friendly interface, detailed product descriptions, size guides, and high-quality images to make informed choices. Benefit from regular discounts, flash sales, and promotional offers that provide the best value for your money. Create a personalized shopping experience by saving favorites, tracking orders, and receiving tailored recommendations based on your preferences. SHEIN also provides secure payment options, fast delivery, and easy returns to ensure a hassle-free experience. Whether you’re searching for everyday essentials, statement pieces, or the latest fashion trends, SHEIN makes online shopping fun, convenient, and accessible. Join millions of fashion enthusiasts worldwide who trust SHEIN for quality, affordability, and style. Upgrade your wardrobe today and explore a world of fashion possibilities, unique designs, and endless inspiration at your fingertips.",
    "size": 200,
    "reviews": 1.8,
    "ratingAvg": 4.6,
    "downloads": 2.19,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 2800000 },
      { "name": "5 star", "count": 5000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/fGS3Gs86/Netflix.png",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 16,
    "description": "Discover the ultimate streaming experience with Netflix, the world’s leading platform for movies, TV shows, documentaries, and exclusive original content. Explore a vast library of entertainment across genres including drama, comedy, action, thriller, animation, and family-friendly content. Enjoy binge-worthy series, critically acclaimed films, and award-winning originals like Stranger Things, The Crown, and Money Heist, all available on-demand. Netflix offers seamless streaming on multiple devices including smartphones, tablets, smart TVs, and computers, ensuring your favorite content is always accessible. Personalize your viewing experience with curated recommendations based on your interests and watch history. Download shows and movies for offline viewing, create multiple user profiles for family members, and enjoy ad-free entertainment with high-quality video and subtitles in multiple languages. Stay updated with the latest releases, seasonal specials, and exclusive premieres that make every viewing experience unique. Netflix combines convenience, variety, and innovation to provide an immersive entertainment experience for users worldwide. Whether you are a casual viewer or a dedicated fan, Netflix makes it easy to enjoy top-notch content anytime, anywhere. Join millions of subscribers today and unlock a world of endless entertainment, thrilling stories, and unforgettable experiences at your fingertips.",
    "size": 150,
    "reviews": 1.21,
    "ratingAvg": 4.4,
    "downloads": 1.81,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 5500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/cc3V5tS2/Roblox.jpg",
    "title": "Roblox",
    "companyName": "Roblox Corporation",
    "id": 17,
    "description": "Explore the exciting universe of Roblox, the ultimate online platform where creativity meets gaming. Roblox allows millions of players to create, share, and play games made by users from around the world. Dive into endless virtual worlds, from action-packed adventures to role-playing simulations, obstacle courses, racing games, and more. Customize your avatar with unique outfits, accessories, and special items to express your style and personality. Connect with friends, join communities, and participate in interactive events that make every experience unique and social. Roblox offers an intuitive interface and cross-platform support, so you can play on PC, mobile, or console with seamless access. Learn coding and game development skills while building your own games, leveling up your creativity, and potentially earning Robux, the in-game currency. Enjoy frequent updates, themed events, and seasonal content that keeps the platform fresh and engaging for players of all ages. Whether you are a casual gamer looking for fun or a dedicated creator designing complex games, Roblox provides endless opportunities for exploration, creativity, and social interaction. Join the global Roblox community today and unlock a world of fun, innovation, and adventure that grows every day.",
    "size": 160,
    "reviews": 1.4,
    "ratingAvg": 4.5,
    "downloads": 1.75,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1300000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 8000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Y4JTGMhy/Subway-Surfers.jpg",
    "title": "Subway Surfers",
    "companyName": "Kiloo / SYBO Games",
    "id": 18,
    "description": "Join the thrilling world of Subway Surfers, the ultimate endless runner game that has captured millions of players worldwide. Dash, dodge, and surf your way through vibrant subway tracks, avoiding trains and obstacles while collecting coins, power-ups, and special rewards. Experience fast-paced action with smooth controls, exciting missions, and daily challenges that keep the gameplay fresh and addictive. Unlock and upgrade a variety of characters, each with unique outfits and hoverboards, and explore dynamic locations from around the world with regular updates. Compete with friends and players globally, aiming for high scores and leaderboard rankings that showcase your skills. Enjoy stunning graphics, immersive sound effects, and an intuitive interface that makes playing fun for all ages. Whether you are a casual gamer looking for a quick thrill or a dedicated player aiming for mastery, Subway Surfers offers endless excitement and challenges. Participate in seasonal events, collect limited-time items, and take part in special missions that reward your achievements. Download Subway Surfers now and embark on an adrenaline-filled adventure where speed, agility, and strategy determine your success in the fast-paced world of subway surfing.",
    "size": 180,
    "reviews": 5.0,
    "ratingAvg": 4.6,
    "downloads": 1.7,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 2500000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 25500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/fdmrmjvB/App-Store.jpg",
    "title": "App Store",
    "companyName": "Apple Inc.",
    "id": 19,
    "description": "Discover the ultimate App Store experience, where millions of apps and games are just a tap away. Explore top-rated apps across categories like productivity, entertainment, education, health, and social networking, curated to help you find the perfect digital tools for your lifestyle. Download apps safely and quickly with trusted reviews, ratings, and detailed descriptions to ensure you make informed decisions. Stay updated with the latest releases, trending apps, and exclusive offers to enhance your mobile experience. Whether you are looking for innovative productivity tools, immersive gaming experiences, creative photo and video editors, or essential daily utilities, the App Store provides a seamless platform for discovering and managing applications. Benefit from personalized recommendations based on your preferences and usage patterns, making it easier than ever to discover apps that suit your needs. Learn about app features, updates, and developer information, ensuring a smooth and informed download experience. With a secure and user-friendly interface, the App Store makes finding, installing, and managing apps simple and enjoyable. Unlock the potential of your device and enhance your digital lifestyle with access to thousands of high-quality applications designed to entertain, educate, and empower users worldwide.",
    "size": 60,
    "reviews": 2.57,
    "ratingAvg": 4.5,
    "downloads": 6.0,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 10500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/s935JmrV/Google.png",
    "title": "Google",
    "companyName": "Google LLC",
    "id": 20,
    "description": "Discover the ultimate online resource for everything you need to know about modern technology, apps, and digital solutions. Stay updated with the latest trends, tips, and tutorials designed to help beginners and experts alike navigate the ever-evolving world of tech. Explore in-depth reviews of software, mobile applications, and innovative gadgets that make your daily life easier and more productive. Learn practical strategies for improving digital skills, boosting online presence, and optimizing your workflow with expert advice and step-by-step guides. Whether you are a student, professional, or tech enthusiast, our platform offers easy-to-understand explanations, actionable insights, and reliable information to make informed decisions. From comprehensive guides on cloud computing, cybersecurity, and artificial intelligence to tips on mobile optimization, social media growth, and productivity hacks, we provide content that keeps you ahead in the digital landscape. Engage with tutorials, how-to articles, and expert recommendations tailored to your needs, helping you save time, avoid common mistakes, and achieve measurable results. Unlock the potential of technology with our well-structured, easy-to-follow resources, designed to empower users to explore, learn, and thrive in a digital-first world. Stay informed, connected, and inspired with our cutting-edge technology insights and resources.",
    "size": 120,
    "reviews": 90.0,
    "ratingAvg": 4.2,
    "downloads": 16.0,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 16000000 }
    ]
  }
]
